{
    "Classic Omelette": {
        "ingredients": [
            "egg",
            "butter",
            "onion"
        ],
        "steps": [
            "Crack the eggs into a bowl and whisk until smooth.",
            "Heat butter in a pan over medium heat.",
            "Add chopped onions and sauté until soft.",
            "Pour the eggs into the pan and cook until set.",
            "Fold the omelette in half and serve."
        ]
    },
    "Potato Gratin": {
        "ingredients": [
            "potato",
            "butter",
            "milk",
            "onion"
        ],
        "steps": [
            "Preheat the oven to 375°F (190°C).",
            "Thinly slice the potatoes and onions.",
            "In a pan, melt butter and sauté onions until translucent.",
            "In a baking dish, layer the potatoes and onions, pouring milk over each layer.",
            "Cover with foil and bake for 45 minutes, then remove foil and bake for an additional 15 minutes."
        ]
    },
    "Mashed Potatoes": {
        "ingredients": [
            "potato",
            "butter",
            "milk"
        ],
        "steps": [
            "Peel and boil the potatoes until tender.",
            "Drain the potatoes and mash them with butter and milk.",
            "Season with salt and pepper, and serve."
        ]
    },
    "Potato Soup": {
        "ingredients": [
            "potato",
            "onion",
            "butter",
            "milk"
        ],
        "steps": [
            "Peel and chop the potatoes and onions.",
            "In a pot, sauté the onions in butter until soft.",
            "Add the potatoes and cover with water. Bring to a boil and simmer until potatoes are soft.",
            "Mash the potatoes in the pot and add milk to reach desired consistency.",
            "Season with salt and pepper and serve."
        ]
    },
    "Egg Salad": {
        "ingredients": [
            "egg",
            "onion",
            "butter"
        ],
        "steps": [
            "Boil the eggs and chop them into small pieces.",
            "In a pan, sauté onions in butter until soft.",
            "Mix the eggs and onions in a bowl, adding salt and pepper to taste.",
            "Serve on toast or as a side dish."
        ]
    },
    "French Toast": {
        "ingredients": [
            "egg",
            "milk",
            "butter"
        ],
        "steps": [
            "Whisk eggs and milk together in a bowl.",
            "Dip slices of bread into the egg mixture, coating each side.",
            "Cook the bread slices in a buttered pan until golden brown on both sides.",
            "Serve with syrup or powdered sugar."
        ]
    },
    "Scalloped Potatoes": {
        "ingredients": [
            "potato",
            "milk",
            "butter",
            "onion"
        ],
        "steps": [
            "Preheat the oven to 350°F (175°C).",
            "Slice the potatoes thinly and chop the onions.",
            "In a pan, sauté onions in butter, then add milk and bring to a simmer.",
            "Layer potatoes and onion mixture in a baking dish, then bake for 40 minutes."
        ]
    },
    "Potato and Egg Breakfast Burrito": {
        "ingredients": [
            "potato",
            "egg",
            "onion",
            "butter"
        ],
        "steps": [
            "Sauté diced onions and potatoes in butter until golden and tender.",
            "Scramble eggs in a separate pan and mix with the potatoes and onions.",
            "Wrap the mixture in a tortilla to form a burrito."
        ]
    },
    "Potato Frittata": {
        "ingredients": [
            "potato",
            "egg",
            "onion",
            "butter"
        ],
        "steps": [
            "Sauté onions and thinly sliced potatoes in butter until soft.",
            "Whisk eggs and pour over the potatoes in the pan.",
            "Cook until the eggs are set, then broil for 2 minutes to brown the top."
        ]
    },
    "Creamy Potato Salad": {
        "ingredients": [
            "potato",
            "milk",
            "butter",
            "onion",
            "egg"
        ],
        "steps": [
            "Boil the potatoes until tender, then chop them into cubes.",
            "Boil eggs, peel and chop them.",
            "In a bowl, combine potatoes, eggs, and chopped onions.",
            "In a separate bowl, mix butter and milk to create a creamy dressing, then mix with the potatoes."
        ]
    },
    "Potato Pancakes": {
        "ingredients": [
            "potato",
            "egg",
            "onion",
            "butter"
        ],
        "steps": [
            "Grate the potatoes and squeeze out excess moisture.",
            "Mix grated potatoes, egg, and chopped onions.",
            "Fry spoonfuls of the mixture in butter until golden brown on both sides."
        ]
    },
    "Egg and Onion Stir Fry": {
        "ingredients": [
            "egg",
            "onion",
            "butter"
        ],
        "steps": [
            "Sauté onions in butter until golden.",
            "Scramble eggs in a separate pan and add them to the onions.",
            "Stir fry until fully cooked and serve."
        ]
    },
    "Cheese and Potato Casserole": {
        "ingredients": [
            "potato",
            "butter",
            "milk",
            "onion"
        ],
        "steps": [
            "Preheat the oven to 375°F (190°C).",
            "Sauté onions in butter until soft, then add sliced potatoes.",
            "Layer potatoes, onions, and cheese in a casserole dish, pour over milk.",
            "Bake for 30 minutes or until golden brown."
        ]
    },
    "Onion Rings": {
        "ingredients": [
            "onion",
            "butter"
        ],
        "steps": [
            "Slice onions into rings and dip in a batter of flour, milk, and seasonings.",
            "Fry in butter until crispy and golden."
        ]
    },
    "Egg and Potato Skillet": {
        "ingredients": [
            "egg",
            "potato",
            "butter",
            "onion"
        ],
        "steps": [
            "Cube potatoes and fry in butter until crispy.",
            "Add diced onions and cook until soft.",
            "Crack eggs into the skillet and cook until done to your liking."
        ]
    },
    "Creamy Potato and Onion Soup": {
        "ingredients": [
            "potato",
            "onion",
            "butter",
            "milk"
        ],
        "steps": [
            "Sauté onions in butter until soft.",
            "Add diced potatoes and cook until golden.",
            "Add milk and simmer until the potatoes are tender.",
            "Blend the soup until smooth and serve."
        ]
    },
    "Milk and Honey French Toast": {
        "ingredients": [
            "egg",
            "milk",
            "butter"
        ],
        "steps": [
            "Whisk eggs and milk together, adding a bit of honey.",
            "Dip slices of bread in the mixture and cook in butter until golden.",
            "Serve with syrup or powdered sugar."
        ]
    },
    "Baked Potatoes with Butter and Onion": {
        "ingredients": [
            "potato",
            "butter",
            "onion"
        ],
        "steps": [
            "Pierce the potatoes with a fork and bake in the oven until tender.",
            "Top with butter and sautéed onions before serving."
        ]
    },
    "Potato and Onion Quiche": {
        "ingredients": [
            "potato",
            "onion",
            "egg",
            "butter"
        ],
        "steps": [
            "Sauté onions and diced potatoes in butter until soft.",
            "Whisk eggs and pour over the potato and onion mixture.",
            "Bake until the eggs are set and golden."
        ]
    },
    "Creamed Potatoes": {
        "ingredients": [
            "potato",
            "butter",
            "milk"
        ],
        "steps": [
            "Boil potatoes until soft, then mash them with butter and milk.",
            "Season with salt and pepper and serve."
        ]
    },
    "Potato Tacos": {
        "ingredients": [
            "potato",
            "onion",
            "butter"
        ],
        "steps": [
            "Sauté diced potatoes and onions in butter.",
            "Serve in tortillas with salsa and toppings."
        ]
    },
    "Egg and Potato Soup": {
        "ingredients": [
            "egg",
            "potato",
            "butter",
            "milk",
            "onion"
        ],
        "steps": [
            "Sauté onions and potatoes in butter until golden.",
            "Add water and simmer until the potatoes are soft.",
            "Beat eggs and add to the soup, stirring to cook the eggs."
        ]
    },
    "Egg and Onion Bagel": {
        "ingredients": [
            "egg",
            "onion",
            "butter"
        ],
        "steps": [
            "Fry onions in butter until soft.",
            "Fry an egg and place it on a toasted bagel.",
            "Top with the sautéed onions and serve."
        ]
    },
    "Egg and Potato Casserole": {
        "ingredients": [
            "egg",
            "potato",
            "butter",
            "milk"
        ],
        "steps": [
            "Layer thinly sliced potatoes in a baking dish.",
            "Whisk eggs and milk together, then pour over the potatoes.",
            "Bake until golden and set."
        ]
    }
}